blog-posts/2004-02-16-gnuemacssourcestex-skakel-a-way-to-typeset-chess-moves-and-board-diagrams-in-latex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>gnu.emacs.sources/tex-skak.el: a way to typeset chess moves and board</title>
<!-- 2015-10-19 Mon 14:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">gnu.emacs.sources/tex-skak.el: a way to typeset chess moves and board</h1>
<p>
diagrams in LaTeX
</p>

<p>
February 16th, 2004 -
<a href="http://sachachua.com/blog/p/1718"><a href="http://sachachua.com/blog/p/1718">http://sachachua.com/blog/p/1718</a></a>
</p>

<blockquote>
<p>
This is a special mode for editing LaTeX files which use the skak
package.
</p>
</blockquote>

<blockquote>
<p>
\usepackage{skak} is a beautiful way to typeset chess
 moves and board diagrams in LaTeX. This file implements
 a special editing mode for such documents ontop of the
 AUC TeX and chess.el packages. Both packages are very
 flexible and extensible. This file can be considered glue
 code to unify the power of both packages.
</p>
</blockquote>

<p>
Mirrored at
<a href="http://sachachua.com/notebook/emacs/tex-skak.el">../emacs/tex-skak.el</a>
</p>

<p>
E-Mail from Mario Lang
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
